In [40]:
pip install pandas

Requirement already satisfied: pandas in c:\users\niranjan gowda ks\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\niranjan gowda ks\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\niranjan gowda ks\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\niranjan gowda ks\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\niranjan gowda ks\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\niranjan gowda ks\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [41]:
import pandas as pd
import numpy as np
import seaborn as sns 
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

In [42]:
df=sns.load_dataset("tips")

In [43]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [44]:
df.head() # top rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [45]:
df.columns #shows columns names

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [46]:
df.tail() # bottom rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [47]:
df.info()# give information about data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [48]:
df.describe() #statistical discription of data

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [49]:
df.shape # it shows dimentionality ,'()' not required

(244, 7)

In [50]:
df.size # #number of elements

1708

In [51]:
df.dtypes # data type of each col

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [52]:
df.isnull().sum() # total number of missing valsue

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [39]:
df.duplicated().sum()

np.int64(1)

In [ ]:
# in pandas there is 2 data structures that is series and DataFrame
data=np.array(['a','b','c','d','e'])
data1=pd.Series(data,index=[1,2,3,4,5]) #Converts the NumPy array into a Pandas Series

In [61]:
data2=pd.Series(data)
data2

0    a
1    b
2    c
3    d
4    e
dtype: object

In [66]:
df=pd.DataFrame(data)

In [74]:
# data ingection or data loading
#csv=read_csv
#xlsx,xlx=raed_excel
#json=read_json
#sql or mysql =read_sql

# example:
df1=pd.read_json(r'pythonfile.json')

In [80]:
#convertion
#csv= to_csv 
#xlsx= to_exel
#json= to_json
df.to_json('data.csv')

In [104]:
# data exploation
data=pd.DataFrame({'a':[1,2,None,4,None,60,70,1.0,1000],'b':[7,None,9,11,None,50,7,1,6]})

In [89]:
data.isnull().sum()

a    2
b    2
dtype: int64

In [ ]:
# finding the outliers
def find_outlier(df,columns):
    outlier_indices=set() 
    for col in columns:
        q1=df[col].quantile(0.25)
        q3=df[col].quantile(0.75)
        iqr=q3-q1
        lower_bound= q1-1.5*iqr
        upper_bound = q3+1.5*iqr
        col_outliers=df[(df[col]<lower_bound)|(df[col]>upper_bound)]
        outlier_indices.update(col_outliers.index)
        
    return df.loc[list(outlier_indices)]
outliers=find_outlier(data,['a','b'])
print(outliers)

        a     b
8  1000.0   6.0
5    60.0  50.0
7     1.0   1.0

In [111]:
data

        a     b
0     1.0   7.0
1     2.0   NaN
2     NaN   9.0
3     4.0  11.0
4     NaN   NaN
5    60.0  50.0
6    70.0   7.0
7     1.0   1.0
8  1000.0   6.0

In [114]:
data['a'].fillna(round(data['a'].mean(),2))
data.drop_duplicates(inplace=True)
def log_transform(df,columns):
    transformed_df=df.copy()
    for col in columns:
        transformed_df[col]=np.log1p(transformed_df[col])
    return transformed_df
log=log_transform(data,['a','b'])
print(log)

          a         b
0  0.693147  2.079442
1  1.098612       NaN
2       NaN  2.302585
3  1.609438  2.484907
4       NaN       NaN
5  4.110874  3.931826
6  4.262680  2.079442
7  0.693147  0.693147
8  6.908755  1.945910

In [160]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva','nir'],
    'Age': [25, 30, 35, 28, 24,None],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin','bolre'],
    'Salary': [60000, 75000, 80000, 62000, 57000,None],
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',None],
    'Category': ['A', 'B', 'C', 'A', 'B','C']
}
df = pd.DataFrame(data)
df.to_csv('data.csv')

In [156]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)
df['Age'].fillna(round(df['Age'].mean(),2),inplace=True)#(,2)Rounds that mean value to 2 decimal
df['Salary'].fillna(round(df['Salary'].mean(),2),inplace=True)
df['Category'].fillna(round(df['Category'].mode(),2),inplace=True)
df.duplicated().sum()

np.int64(0)

In [143]:
#Data Manipulation
df[df['City'].str.contains('New')]

    Name   Age      City   Salary        Date Category
0  Alice  25.0  New York  60000.0  2023-01-01        A

In [146]:
df[df['City'].str.contains('new',case=False)]

    Name   Age      City   Salary        Date Category
0  Alice  25.0  New York  60000.0  2023-01-01        A

In [148]:
df['City'].str.split(' ')

0    [New, York]
1       [London]
2        [Tokyo]
3        [Paris]
4       [Berlin]
5        [bolre]
Name: City, dtype: object

In [162]:
df[df['Category'].str.startswith('A')]

    Name   Age      City   Salary        Date Category
0  Alice  25.0  New York  60000.0  2023-01-01        A
3  David  28.0     Paris  62000.0  2023-01-04        A

In [164]:
df[df['City'].str.endswith('o')]

      Name   Age   City   Salary        Date Category
2  Charlie  35.0  Tokyo  80000.0  2023-01-03        C

In [ ]:
df['Name1']=df['Name'].str.upper() # it autometicali creates new col 
df

      Name   Age      City   Salary        Date Category    Name1
0    Alice  25.0  New York  60000.0  2023-01-01        A    ALICE
1      Bob  30.0    London  75000.0  2023-01-02        B      BOB
2  Charlie  35.0     Tokyo  80000.0  2023-01-03        C  CHARLIE
3    David  28.0     Paris  62000.0  2023-01-04        A    DAVID
4      Eva  24.0    Berlin  57000.0  2023-01-05        B      EVA
5      nir   NaN     bolre      NaN        None        C      NIR